{
  "architectures": [
    "KimiAttnResVLForConditionalGeneration",
    "KimiLinearForCausalLM"
  ],
  "model_type": "kimi_attn_res_vl",
  "text_config": {
    "model_type": "kimi_linear",
    "hidden_size": 1024,
    "intermediate_size": 768,
    "num_hidden_layers": 16,
    "num_attention_heads": 16,
    "num_key_value_heads": 16,
    "head_dim": 64,
    "vocab_size": 163840,
    "hidden_act": "silu",
    "rms_norm_eps": 1e-05,
    "tie_word_embeddings": true,
    "max_position_embeddings": 32768,
    "kv_lora_rank": 512,
    "qk_nope_head_dim": 64,
    "qk_rope_head_dim": 32,
    "v_head_dim": 64,
    "q_lora_rank": null,
    "mla_use_nope": true,
    "num_experts": 32,
    "n_routed_experts": 32,
    "num_experts_per_token": 8,
    "num_shared_experts": 1,
    "moe_intermediate_size": 768,
    "moe_renormalize": true,
    "moe_router_activation_func": "sigmoid",
    "moe_layer_freq": 1,
    "first_k_dense_replace": 1,
    "num_expert_group": 1,
    "topk_group": 1,
    "routed_scaling_factor": 2.446,
    "use_grouped_topk": false,
    "linear_attn_config": {
      "kda_layers": [
        1,
        2,
        3,
        5,
        6,
        7,
        9,
        10,
        11,
        13,
        14,
        15
      ],
      "full_attn_layers": [
        4,
        8,
        12,
        16
      ],
      "num_heads": 16,
      "head_dim": 64,
      "short_conv_kernel_size": 4
    },
    "rope_theta": 10000.0,
    "rope_parameters": {
      "rope_theta": 10000.0,
      "rope_type": "default"
    },
    "attn_res_enabled": true,
    "attn_res_num_blocks": 4
  },
  "vision_tower_path": "google/siglip-base-patch16-224",
  "vision_hidden_size": 768,
  "image_token_id": 32000,
  "max_position_embeddings": 32768
}